app/models/article.rb

    def tag_list=(tags_string)
        tag_names = tags_string.split(",").collect{|s| s.strip.downcase}.uniq
        new_or_found_tags = tag_names.collect { |name|
                tag = Tag.find_or_create_by(name: name) }
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "odin"], ["created_at", "2018-11-04 11:45:20.069183"], ["updated_at", "2018-11-04 11:45:20.069183"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "odin"], ["LIMIT", 1]]